export default {
  titleHighlight: 'SEC.CAFE 安全咖啡',
  sections: [
    {
      title: '初衷',
      paragraphs: [
        '一直都比较有想法，但也一直停留在自己的笔记里，所以希望通过SEC.CAFE实现自己的一些想法，把一些好玩好用的安全项目逐步上线，让它成为一个可以被大家真的使用起来的安全社区！'
      ]
    },
    {
      title: '为什么取名SEC.CAFE',
      paragraphs: [
        '一方面是自己手上正好有这样一个域名(还有sec.style/guide，大家有好想法也可以告诉我)。',
        '另一方面觉得做安全真的比较累，比较卷，希望大家能坐下来休息下，喝一杯咖啡，让安全重新成为最初的兴趣，回归每一次突破的乐趣。'
      ]
    }
  ],
  timelineTitle: '更新日志',
  timeline: [
    {
      time: '2023年5月',
      title: '漏洞情报',
      subtitle: '多源聚合去重 · 快速监测 · 免费订阅',
      description: '从业这么多年，无论是在乙方安全公司安全研究，还是后来负责甲方做企业安全，漏洞情报一直都是个基础安全设施，所以选择作为第一个项目。'
    },
    {
      time: '2023年12月',
      title: '安全手册',
      subtitle: '企业安全实践、攻防与安全研究知识库',
      description: '我们力争给安全从业者提供最完整、最准确的安全知识参考内容。知识库内容主要是来自互联网及大家的贡献，也欢迎每一位使用安全手册的同行贡献你的一份力量。'
    },
    {
      time: '2024年9月',
      title: 'SECSOSO 安全搜索',
      subtitle: '一个AI驱动的网络安全内容聚合搜索引擎',
      description: '安全搜搜，搜索安全，AI驱动的网络安全内容聚合搜索！它基于互联网元搜索引擎、安全知识库、大模型、RAG等技术构建，专门为网络安全垂直行业提供服务。'
    },
    {
      time: '2024',
      title: '敬请期待',
      subtitle: '敬请期待',
      description: '敬请期待'
    }
  ]
}
